Idealized_Reef_CFD/Scenario_1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       225594;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       225619;
    }
    atmosphere
    {
        type            patch;
        nFaces          712;
        startFace       225659;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          226886;
        startFace       226371;
    }
    bedSurface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6137;
        startFace       453257;
    }
)

// ************************************************************************* //
