Idealized_Reef_CFD/Scenario_1/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    bathymetrySample;
        type    cellSet;
        action  new;
        source  surfaceToCell;
        sourceInfo
        {
            file "constant/triSurface/bathymetry_sample.stl";
            outsidePoints ((1 -0.0015 0));
            includeCut      true;
            includeInside   true;
            includeOutside  false;
            nearDistance    -1;
            curvature       -100;
            useSurfaceOrientation   false;
        }
    }
    {
        action  new;
        name    bathymetrySample;
        type    cellZoneSet;

        source  setToCellZone;
        sourceInfo
        {
            set bathymetrySample;
        }
    }
);

// ************************************************************************* //
